var store = [{
        "title": "21.07.20 TIL",
        "excerpt":"   오늘 한 일  1. 변수  2. 타입  3. 함수  4. 조건문  5. HTML        오늘 느낀 점           코드스테이츠 2일차.. 잠을 엄청 설쳤다… 부담감 때문인가? 스트레스 컨트롤도 중요해보인다…            어제 처음 작성한 TIL의 내용이 너무 난잡했다. 아무리 웹 공부지만 개념 긁어오기(?) 정도일 뿐이다. 학습하며 느껴졌던 어려움이나 느낀점 만 간략히 TIL에 서술식으로 서술 하고 학습한 개념은 따로 포스팅하는게 알맞다 생각된다. (포스팅을 하며 스스로 학습도 되며, 간략한 코드를 붙혀넣기가 아닌 마크다운 형식으로 직쩝 짜보는것으로 충분히 도움은 되는듯 하니 학습내용 포스팅은 계속 진행할 예정.)       구글은 신이다.            mdn 키워드 mdn 자체가 읽기가 어려워….. 익숙해지자       How to 키워드 생활하 하기 자바스크립트 경우 + in Javascript 키워드 포함.       Stack Overflow 애용하기 아직은 봐도 잘 모르겠다…                처음으로 둘 이상의 인원이 모여 ZOOM을 통한 협업으로 코드 풀이를 해보았다. 생각보다 ZOOM 을 통한 협업은 불편하지 않았다, 화면쉐어링 등 기본 제공하는 툴들만으로도 의견 전달에는 문제가 없었다. pair 훈련 자체가 오늘 첫 시행이라 code 난이도가 낮았기에 회의 시간은 제공된 시간 보다는 빠르게 소화할 수 있었다. 앞으로는 거부감 없이 할 수 있을 듯 하다.       생활코딩 수업 html, css, javascript 다시 듣기. 웹애플리케이션만들기 수업정도만 겉핣기식 따라하기 수업은 머릿속에 개념만 넣는 정도였다. 조금더 심화내용 수업을 들으며 개념확장 필요하다 생각된다.         내일 할 일     변수   자료형   조건문   문자열   생활코딩 html css            html은 너무 기본적인 문법 및 코드스테이츠 커리큘럼과는 맞지 않는 방향이라 개념만 정립 후 css 수업으로 진행 예쩡.          ","categories": ["TIL"],
        "tags": [],
        "url": "/til/TIL/",
        "teaser": null
      }]
